{
  "id": "360860F2-3F77-4989-81DF-FF43B9F96FF7",
  "title": "社内読書会でThe Rust Programming Languageを読破した",
  "raw": ":PROPERTIES:\n:ID:       360860F2-3F77-4989-81DF-FF43B9F96FF7\n:END:\n#+TITLE: 社内読書会でThe Rust Programming Languageを読破した\n#+AUTHOR: takeokunn\n#+DESCRIPTION: description\n#+DATE: 2025-12-25T10:09:25+0900\n#+HUGO_BASE_DIR: ../../\n#+HUGO_CATEGORIES: permanent\n#+HUGO_SECTION: posts/permanent\n#+HUGO_TAGS: permanent rust\n#+HUGO_DRAFT: false\n#+STARTUP: fold\n* 1. Introduction\n\n社内でRust本の読書会を開催したのですが、大成功で終わりました。\n過去に社内読書会に参加した経験から、読書会というのはうまくいかないものだと思っていました。\n途中で自然消滅したり、一部の人だけが話して終わったり、結局何も身につかなかったりと、苦い経験がいくつもあります。\n\n今回は全員満足度も理解度も高く大成功に終わったという実感があるので、何が良かったのか後学の為に纏めておきます。\n\nあくまで私個人の経験に基づく独断と偏見が多分に含まれている点をご了承ください。\n\n* 2. 開催情報\n** 2.1. 基本情報\n\n次の期間/時間に開催しました。\n\n- 2025年9月〜2025年12月\n- 毎日平日 17:00〜17:30\n\n20章と分量のある[[https://doc.rust-jp.rs/book-ja/title-page.html#the-rust-programming-language-%E6%97%A5%E6%9C%AC%E8%AA%9E%E7%89%88][The Rust Programming Language 日本語版]]を読破しました。\nメンバーは8人程度で、2人がRust熟練者、それ以外はRust初学者という構成でした。\n\n** 2.2. 時間設定の意図\n\n17:00〜17:30という時間帯は業務の終盤で集中力が切れやすい時間帯です。\n読書会にあてることでリラックスできたかなと思っています。\n\n30分という短い時間の意図はそもそもが業務時間内というのと毎日継続するのにちょうどよい長さだからでした。\n長時間の読書会は準備も負担も大きくなりがちですが、30分であれば「今日はちょっと疲れているな」という日でも参加しやすかったです。\n\n** 2.3. 進め方\n\n30分間の内訳は以下です。\nドキュメントツールに開催日付で記事を作り、共同編集で学んだことをメモする形式にしていました。\n\n- 前半20分: 前回の続きから読書、学んだことや発見や疑問を雑にメモする\n- 後半10分: メモを見ながら全員に共有\n\n* 3. 個人的な目標\n\n「落ち着いて座学をやる」というのが年々苦手になってきていた実感があったので、「ちゃんと机に座ってひとつずつ落ち着いて理解しながら進めていく」というのを目標に掲げていました。\nプログラミング言語の勉強といえど、手を一切動かさず、頭だけで理論を理解することを徹底しました。\n\n特に今回の題材は理論を丁寧に理解していく必要があるRustだったので、題材としてはうってつけでした。\n\nまた、「他言語で得た知識で知ったかぶりしない」という目標もありました。\n良くも悪くも普段プログラムを書いているせいで大体の言語は手なりに書けてしまっていますし、特に最近はAIのせいで深く考えなくても良くなってしまっています。\nこれが成長の足枷になってしまっているなという実感があったので、今回は理解が浅い部分の理解をサボらないことにしました。\n\n* 4. うまくいった理由の考察\n\n主に次の3パターンの取り組みをしました。\n\n- 元の文章を読む\n- Geminiで理解の浅い所を深堀する\n- 自分の理解した部分を有識者に語る会を開く\n\n** 4.1. Geminiの活用\n\n普段の読書会中は、その日に読む分をGeminiに質問しまくりながら読んでいました。\nGeminiに「自分の理解ではこうだけどあってる?」のようにとにかく聞いて正確な理解に努めました。\n一般的な知識なのでハルシネーションがほぼなかったです。\n\n具体的には次のような質問を投げていました。\n\n- 「このコードがコンパイルエラーになる理由を、ライフタイムの観点から説明して」\n- 「自分の理解ではこうだけど合ってる？」という確認\n\n疑問点をすぐに解消できたのが助かりました。\n\n** 4.2. 有識者に語る会\n\nとはいえ、Rustは「所有権」や「借用」や「ライフタイム」や「スマートポインタ」など理解しにくい概念がいくつもあります。\nそこで、必要に応じて「自分の理解した部分を有識者に語る会」を30分設けてもらいました。有識者にひたすら自分の理解を喋りまくるという形式です。\n\n「有識者に語る」というのが非常に重要でした。\n言葉を適当に濁せないし、用語を適当に使えないし、ちゃんと準備をしないといけないのが体験としてよかったです。\nGeminiに質問攻めして「何が説明できれば俺は理解してるといえると思う?」とプロンプトに投げまくってました。\n\n有識者に説明すると新しい知識が出てきたり、自分の中でしっくりする理解ができたのが良かったです。\n\n世間的にはファインマンテクニックと呼ばれる手法です。\n\n[[https://qiita.com/KanNishida/items/e2e926bb194fd280c6d9][人生を変える最強学習メソッド、ファインマン・テクニック - Qiita]]\n\n** 4.3. チーム構成と継続性\n\n自分以外にもRust初心者が多かったので、他の人の質問から派生した知識も理解できました。読書会はチーム構成が重要だなと思いました。\n有識者は必ず1人は必要ですね。\n\n「毎日必ず集まって読む」というのもよい取り組みでした。\n日によっては眠かったりやる気がない日もありましたが、時間を固定化することによってコツコツ進められました。\n現代社会に自分を最適化すべく「要点だけをうまく抽出して速習をしなくちゃいけない」ものだと思い込んでいた節があったので反省させられました。\n* 5. 今後やりたいこと\n\nこの3ヶ月で座学レベルでそれなりにRustを理解できたはずですが、ほぼプログラムを手元のエディタで書かずに終わってしまいました。\n\nプログラムは動かしてなんぼなので、まずはJSONパーサを書いてみたいと考えています。\nJSONパーサは練習題材としてちょうど良さそうですね。\n\n他にも、家に積読が山のようにあるのでゆっくりコツコツ読んでいきたいです。\n理解した内容を文章に纏めておき、必要に応じて説明できるようにしておくことは年々忘れっぽくなってる今こそ必要なことのように感じています。\nZettelkastenでいうところのLiterature Notesを積極的に書いていきたいです。\n",
  "backlinks": [
    {
      "title": "「The Rust Programming Language 日本語版」の読書記録",
      "source": "14DF55E5-A51C-426A-A8D5-C6AB7DF3E5C0"
    }
  ]
}