{
  "id": "AC43842A-ED0F-42D7-A430-4BD4154635F6",
  "title": "プロポーザルの出し方・心構え",
  "raw": ":PROPERTIES:\n:ID:       AC43842A-ED0F-42D7-A430-4BD4154635F6\n:END:\n#+TITLE: プロポーザルの出し方・心構え\n#+AUTHOR: takeokunn\n#+DESCRIPTION: description\n#+DATE: 2025-07-22T19:00:00+0900\n#+HUGO_BASE_DIR: ../../\n#+HUGO_CATEGORIES: fleeting\n#+HUGO_SECTION: posts/fleeting\n#+HUGO_TAGS: fleeting proposal\n#+HUGO_DRAFT: false\n#+STARTUP: fold\n* 1. Introduction\n\n最近プロポーザルの出し方について話す機会が身近で増えました。\n私自身、過去にPHPカンファレンスなどの技術イベントで何度も登壇した経験があります。\n本記事ではそうした経験から得られたプロポーザルを書く上での心構えや具体的なTipsについて解説します。\n\nまた、多くの人が悩む「プロポーザルを出すネタがない」という課題に対する私なりの解決策も提示したいと考えています。\n\nあくまで私個人の経験に基づく独断と偏見が多分に含まれている点、また、自分はこうありたいという理想を書いている点をご了承ください。\n\n* 2. 今北産業\n\n- 日々学んだことや取り組んだことをアウトプットしよう\n- アウトプットしたものを元に魅力的なプロポーザルを作ろう\n- カンファレンスに限らず積極的に打席に立とう\n\n* 3. 今回のスコープ\n\n本記事で対象とするカンファレンスは、主にPHPカンファレンスのような技術カンファレンスを想定しています。\n\n一口にカンファレンスと言ってもその規模や目的はさまざまです。\nたとえば国際カンファレンスであれば一定の権威性がありますし、地方のカンファレンスであれば一般的な勉強会の延長線上にあります。\n本記事では特にカンファレンスの規模を区別せずに書いています。\n\nまた、トークの長さとしては15分〜30分程度のものをイメージしています。\n5分程度のLTはゲーム性が異なると考えているため本記事のスコープ外とします。\n\n* 4. 直近出したプロポーザル\n** 4.1. 実例\n\n直近の2025年前半に提出したプロポーザルを実例として紹介します。\n\nPHPConで採択されたプロポーザルは次のとおりです。\n\n- [[https://fortee.jp/phpcon-nagoya-2025/proposal/8c520c5c-d564-4f6e-b5d9-10821b35d98c][PHPUnitを低速化する技術 - PHPカンファレンス名古屋2025]]\n- [[https://fortee.jp/phperkaigi-2025/proposal/9484cc8e-4002-4d1e-8b30-f11f6a91f853][Phpactorから学ぶLanguage Server Protocolの仕組み - PHPerKaigi 2025]]\n  - pdf: https://www.takeokunn.org/pdf/phperkaigi-2025-pamphlet.pdf\n- [[https://fortee.jp/phpconodawara-2025/proposal/6d853d31-19ed-4e75-b7fb-841b9490d9a8][定義ジャンプ入門 - PHPカンファレンス小田原2025]]\n- [[https://fortee.jp/phpconniigata-2025/proposal/ab0380b4-95fd-4dad-8788-c0795bb15815][AWS SQSとLaravelで大規模トラフィックを捌く - PHPカンファレンス新潟2025]]\n- [[https://fortee.jp/phpcon-2025/proposal/fcae051f-5b13-4e08-989b-721edadb7134][yieldが変えるLaravelの世界：LazyCollection徹底入門 - PHP Conference Japan 2025]]\n\nPHPCon関西で不採択となったプロポーザルは次のとおりです。\n\n-  https://fortee.jp/phpcon-kansai2025/proposal/rejected?q=takeokunn\n\nVimConfではEmacsに関するテーマで応募しましたが、残念ながら不採択となりました。\n\n- [[https://gist.github.com/takeokunn/141f85d437390607772135f6f98a3882][Org My Life with Vim]]\n- [[https://gist.github.com/takeokunn/2db3fec85d4c374e9ffaacfe4ad1d221][Beyond One Thing: A Vim & Emacs Strategy for Role Separation]]\n\n** 4.2. ポリシー\n\nこれはあくまで私個人のルールなので参考にされてもされなくても構いません。\n\n*** 4.2.1. 絶対に登壇駆動でプロポーザルを出さない\n\n「登壇駆動開発」という言葉もありますが、個人的にはそのやり方は好きではありません。\n登壇はあくまで日々の技術的な活動や学びのアウトプットを発表する場であるべきだと考えています。\n自分の経験や知見が十分に蓄積された結果としてプロポーザルがあり、その先に登壇がある、という順番の方がトークに説得力が増してよいものになると思っています。\n\n*** 4.2.2. トークのアウトラインの下書きは必ず作った状態で出す\n\nプロポーザルを出す段階でトーク全体の構成や話す内容がある程度固まっている状態にしています。\n具体的には、話したいことのキーワードを並べるだけでなく、セクションごとの構成やそれぞれのセクションで何を伝えたいのかを箇条書きで書き出しています。\nアウトラインがしっかりしていればプロポーザルの文章も書きやすくなるという利点もあります。\n\n*** 4.2.3. トーク内容を最低でも6割以上理解している状態のときのみ出す\n\n自分の基準としては、トーク内容の6割以上はすでに自分の言葉で説明できる状態であることを目安にしています。\n残りの4割はプロポーザルが採択されてから資料を作成する過程で調査・学習することで補っています。\n不足している知識を学習しつつ、当日のトーク準備にも十分に時間を割けるよい配分だと考えています。\n\n*** 4.2.4. 採択されたトークを使い回さない\n\n一度話した内容を別のカンファレンスで再度プロポーザルとして出すのは、原則として行わないようにしています。\n自分自身にとって新しいテーマに挑戦し続けることが成長に繋がると信じています。\nこれは単に「常に新しいテーマで話すのがかっこいい」という私自身の価値観に基づいているだけで、トークを再演すること自体を否定するものではありません。\n\n* 5. なぜプロポーザルを出すか\n\n[[https://okuramasafumi.hatenablog.jp/entry/2023/07/12/182236][プロポーザルについて2023 - 作文術とか]] にもあるとおり、プロポーザルを出すメリットはいくつもあります。\n\n- プロポーザルを書くことで自分の知識や知見が整理される\n- カンファレンスで話すと注目される\n- コミュニティへの貢献\n- 自己ブランディング\n- 新しい挑戦へのきっかけ\n\n一方、プロポーザルを出すこと自体のデメリットは、登壇準備に時間がかかることくらいで他に特にないと考えています。\nたとえ採択されなかったとしてもプロポーザルを作成する過程で得られるものは大きいです。\n\n* 6. プロポーザルを通すのに必要な要素\n\nプロポーザルが採択されるためには、主に3つの要素が重要だと考えています。\n\n1. 根本的な内容の良さ: トークテーマそのものに価値があり聴衆にとって有益な情報が含まれているか\n2. プロポーザルの質: 伝えたい内容が魅力的かつ分かりやすく文章に落とし込まれているか\n3. 運営側との音楽性の合致と運: カンファレンスのコンセプトや他の登壇者とのバランス、そして最後は運\n\nこのうち、3つ目の「運営側との音楽性の合致と運」は自分ではコントロールが難しい要素です。\nこれについて「運営の苦悩」といった文脈で語られることもありますが応募者側からすると知る由もない部分です。\n\nしかし、カンファレンスによってはイベント運営側が登壇者に期待することを公開していたり、採択基準を明示していたりする場合もあります。\nこれらを事前に確認することで、「音楽性の不一致」をある程度は避けられるかもしれません。\n\n- [[https://speakerdeck.com/magnolia/ibentoyun-ying-karajian-tadeng-tan-zhe-henoqi-dai][イベント運営から見た登壇者への期待 - speakerdeck]]\n- [[https://note.com/phpcon_kansai/n/n0aa7041c46f0][PHPカンファレンス関西2025 採択方法を公開します！ - note]]\n\nとはいえ、プロポーザルが採択されるかどうかの8割は、1と2、つまり「内容の良さ」と「プロポーザルの質」で決まると私は考えています。\nこれらは日々の努力で十分にカバーできる領域であり、この2点に焦点を当てて解説していきます。\n\n* 7. プロポーザルを出すまでのフロー\n** 7.1 フロー図\n\n理想はブログという形でアウトプットすることですが、OSSへのコントリビュート、雑誌や書籍の執筆など形式は問いません。\n私自身も実際には、「5 プロポーザル作成 > 登壇」の後に「4 ブログにまとめる」という順番になるなど柔軟に対応しています。\n\nこれ以降、本記事では「アウトプット」を「ブログ記事を書く」こととして説明します。\n\n[[file:../../static/images/0A382B4C-B08A-4F4C-844A-CD178EA9859F.png]]\n\n#+begin_src mermaid\n  graph TD;\n      subgraph 日々の活動サイクル;\n          A[\"1 生産的な活動\"] --> B{\"2 アウトプットと<br>Next Action決定\"};\n          B --> C[\"3 Next Actionの実行\"];\n          C --> B;\n      end;\n\n      B -- \"知見が溜まったら\" --> D[\"4 ブログに纏める\"];\n      D --> E[\"5 プロポーザル作成\"];\n      D --> F[\"勉強会で登壇する\"];\n\n      subgraph 登壇サイクル;\n          E --> G[\"登壇する\"];\n          G --> H[\"フィードバックを貰う\"];\n      end;\n\n      H -.-> A;\n#+end_src\n** 7.2. 各ステップ解説\n\nこのフローのポイントは、登壇をゴールにするのではなく、日々の学習とアウトプットの延長線上にプロポーザルを位置付けている点です。\nこの点については、[[https://levtech.jp/media/article/column/detail_492/][コントリビュートで沢山の人が救われる。mattn氏が語る、好循環を実現するアウトプット活動の仕組み]] にもまとめられています。\n\n*** 7.2.1. 何か生産的な活動をする\n\nすべての始まりは日々の生産的な活動にあります。\n業務での課題解決、新しいライブラリの試用、個人開発でのツール作成、OSS活動など、何でも構いません。\nたとえば、ハマったエラーとその解決策をメモする、読んだ技術記事の要約と感想を書くといったより小さな一歩でもまったく問題ありません。\n\n重要なのはここでの活動が後のアウトプットの種になるという点です。\n\n*** 7.2.2. 纏まった形でアウトプットをしつつ、Next Actionを決める\n\n活動で得た知見はどんなに小さくてもアウトプットすることが重要です。\nZennのスクラップや短いブログ記事あるいは社内のドキュメントでも構いません。\nこの際、Next Actionを言語化することで次に何をすべきかが明確になります。\n\n*** 7.2.3. Next Actionをさらに実行して、纏まった形でアウトプットする\n\n決めたNext Actionを実行し再び作業していきます。\nこの「活動→アウトプット→次の活動」というサイクルを繰り返すことで、1つのテーマに関する知見が雪だるま式に増えていきます。\n\n*** 7.2.4. ひととおり形になったらブログに纏める\n\nサイクルを何度か繰り返し知見がある程度の塊になったら、それらを体系的に整理し1つの長文ブログ記事として公開します。\nこのブログ記事が後のトークの土台となります。\n\n*** 7.2.5. 4のブログの内容をプロポーザルにする\n\nここまで来ればプロポーザル作成はそれほど難しくありません。\nブログ記事の導入部分がプロポーザルの概要になり、目次がトークのアウトラインになり、結論が聴衆へのメッセージになります。\nすでに質の高いインプットとアウトプットが手元にあるため、自信を持ってプロポーザルを提出できるはずです。\n\nこのサイクルを回し始めることこそが「プロポーザルのネタがない」という悩みを解決する、もっとも確実な方法です。\n\n* 8. どこに対して努力すべきか\n\nこれまでのフローを踏まえた上で、プロポーザルの採択率を上げるためにどこに努力を集中させるべきか、3つのポイントに絞って解説します。\n\n** 8.1. レギュレーションとゲーム性を理解する\n\nプロポーザルがどのようなルールで審査されるのか、その「レギュレーション」と「ゲーム性」を理解する必要があります。\n\n最低限、次の点は必ず確認するとよいでしょう。\n\n- 募集要項を熟読すること: ターゲット層、求めているテーマ、文字数制限、記載すべき項目など、運営側が提示している情報を読む\n- 審査基準を把握すること: カンファレンスによっては審査基準を公開している場合があるので、どのような点が評価されるのかを事前に調査する\n- 過去の採択プロポーザルを読むこと: 採択プロポーザル一覧が公開されていることが多いので、どのようなテーマや書き方のプロポーザルがとおりやすいのか、傾向を把握する\n\nたとえば、VimConfでは匿名ではなく応募者自身の活動を見ることを重視しています。\n\n- [[https://audee.jp/voice/show/94537][【ujihisaさんとmoppさんをお迎えして「VimConf 2024」を振り返り！】エンジニアの楽園 vim-jp ラジオ #21]]\n- [[https://audee.jp/voice/show/94999][【「VimConf 2024」登壇！yuys13さん・kat0hさん登場！】エンジニアの楽園 vim-jp ラジオ #22]]\n\n逆にKaigi on Railsは匿名性を重視しており応募者を一切見ないという方針のようです。\n\n- [[https://sakahukamaki.hatenablog.jp/entry/2025/07/21/183625][【炬燵編】Kaigi on Railsのプロポーザルを評価するときに考えていること、求めていること]]\n- [[https://blog.unasuke.com/2023/kaigionrails-proposal-writing-guide/][Kaigi on RailsにProposalを送ろうと思っている皆さんへ]]\n\nそれぞれのコミュニティでどのような点が重視されているのかを見極める必要があります。\n\n** 8.2. 質の高いブログ記事を増やす\n\nプロポーザルの元ネタは日々の活動サイクルから生まれるブログ記事です。\n質の高い記事をコンスタントに生み出すために、私は次の点を意識しています。\n\n*** 8.2.1. 2種類の記事を書き分ける\n\n質の高いブログ記事を生み出すためには、目的の異なる2種類の記事を戦略的に書き分けるアプローチが有効です。\n\n1つは、日々の活動で得た小さな発見やTipsを記録する「技術メモ」です。\nこれらのメモは、情報の鮮度が高いうちに将来の自分のための備忘録として、あるいは小さな知見の共有として気軽に書き留めます。\nこの段階では完成度よりもスピードを重視します。\nこれは、Zettelkastenでいうところの「fleeting note」にあたります。\n\nそして、これらの技術メモがある程度の量になった段階でそれらを素材として体系的に再構成し、背景やストーリーを肉付けした「長文ブログ記事」を作成します。\nこの長文記事こそが、カンファレンスのプロポーザル提出の際に直接のネタとなります。\nこれは、Zettelkastenでいうところの「permanent note」にあたります。\n\n[[id:E6243AE2-CFE4-4D21-B9B7-E076B13CF486][org-roamで記事を管理しGitHub Actionsで適切に公開する]] にも書いたとおり、個人的にはZettelkastenで管理をするとこのサイクルを回しやすいと考えています。\n\n*** 8.2.2. 想定読者を明確にし、フィードバックを積極的に活用する\n\n記事を執筆する上で「誰に、何を伝えたいのか」という想定読者を明確に設定することは重要です。\n想定読者を具体的にイメージすることで、メッセージがより深く的確に伝わる記事になります。\n\nこの段階で読者からよいフィードバックを得られていれば、それは記事のテーマや内容が魅力的であることの証左です。\nもしその上でプロポーザルが採択されなかったとしても「今回は運営側と音楽性が合わなかっただけだ」と自信を持って割り切ることができるはずです。\n\n** 8.3. 魅力的なプロポーザルの書き方を学ぶ\n\nプロポーザルのレギュレーションにも依りますが、次のようなことを明確に書いた方がよいです。\n\n- アウトラインを最初に提示する\n- 「誰が、何を得られるのか」を明確にする\n- 過去の採択プロポーザルから学ぶ\n\nGoogleで検索すればプロポーザルの書き方に関する記事が山のように見つかります。\n\n- [[https://tech.layerx.co.jp/entry/2025/06/20/180000][技術カンファレンスに出すプロポーザルを書く]]\n- [[https://devblog.thebase.in/entry/2021/07/15/110000][登壇するぞ！って決めてからトークするまでの流れ]]\n- [[https://speakerdeck.com/tomzoh/how-to-hack-the-cfp][カンファレンス主催者から見た プロポーザルを通すコツ / How to hack the CfP]]\n\nAIにレビューしてもらってもいいし、同僚やコミュニティで相談しながら作るのもいいでしょう。\n私の場合、プロンプトを作り込んでAIからフィードバックをもらいながら書いています。\n\n1%でも当選する可能性を上げるという意識で取り組んでいます。\n\n* 9. 落ちた時に考えるべきこと\n\nプロポーザルが採択されない時はいつだって辛いものですが、その原因が「自分の努力不足」なのか、それとも「採択者との相性や運の問題」なのかを切り分けて考えるようにしています。\n\n** 9.1. トークテーマの魅力（内容の良さ）\n\n提案したテーマそのものについて再度考えてみます。\n\n- そもそもこのトークテーマは採択メンバーにとって本当に魅力的だったか\n- ブログ記事が自分が想定していた読者からよい評判を得られていたか\n\n想定していた読者からよい反応が得られていた場合は採択者との方向性が合わなかったと割り切れますし、そもそも反応が悪かったのであれば諦めもつきます。\n\n** 9.2. プロポーザルの完成度（質の高さ）\n\n登壇経験が豊富な友人やコミュニティの仲間、同僚などにプロポーザルを読んでもらい、率直なフィードバックをもらうのがよいでしょう。\n\n- フォーマットを満たしていたか\n- 伝えたい内容がプロポーザルの文章で十分に表現できていたか\n\n** 9.3. 採択メンバーとの相性と運\n\nこればかりは自分ではコントロールできない領域です。\nカンファレンス全体のテーマ構成と合わなかった、競合するプロポーザルに負けた、採択者の琴線に触れなかったなどさまざまな理由が考えられます。\n\nベストを尽くして臨んだ結果不採用になったのであれば潔く諦めるくらいの気持ちでいるのがちょうどよいと思います。\n\n** 9.4. 不採択になったプロポーザルの活かし方\n\nプロポーザルを書いた時間が無駄になることは一切ありません。\nその経験を次に活かせばよいのです。\n\n- リジェクトコンに出す\n- 別の勉強会で発表する\n- 改善して再挑戦する\n\nこのように次の一手を考えることで、不採択という経験もアウトプットサイクルの一部として次への布石とできます。\n\n* 10. プロポーザルのネタがない時に考えるべきこと\n\n「プロポーザルに出すようなネタがない」という悩みは多くの場合、ただの思い込みです。\n何かに取り組んでいれば、誰しも次のサイクルを日常的に無意識に回しているはずだからです。\n\n1. 何か生産的な活動をする\n2. 活動を文章でアウトプットし、Next Actionを決める\n3. Next Actionをさらに実行して、纏まった形でアウトプットする\n\n色々な人の話を聞いている限り、体系的なアウトプットをしていないために知識が整理されず、登壇のネタにできていないだけということが多い印象です。\nそういう場合は友人やコミュニティの仲間に、自分がどのようなテーマで登壇できそうか、今何に取り組んでいるのかを話して、思考を整理する手伝いをしてもらうのがお勧めです。\n\nカンファレンスの本筋とは少し違う内容でも親和性があれば採択されることも多いので「ネタがまったくない」ということはほぼないはずです。\nもし本当に話すことが何もないと感じるのであれば、それは新しい挑戦ができていないということなのかもしれません。\n\n* 11. その他\n\n最後にプロポーザルに関してよく議論されるいくつかのトピックについて、私の個人的な見解を述べます。\n\n** 11.1. 「プロポーザルの審査側を経験した方がよい」というアドバイスについて\n\nこのアドバイスは一度審査側を経験することで「運営側との音楽性の合致と運」という要素を肌で感じられるという点では有益だと思います。\n\nしかしプロポーザルの採択率を上げるという観点では、その効果は限定的だと考えています。\nなぜなら、採択されるプロポーザルの多くは公開されており、それらを分析することで審査基準や傾向は十分に学習可能だからです。\n\n審査側を経験するよりも応募者としてプロポーザルを書く努力を重ねる方が採択率向上への効果は高いというのが私の意見です。\n\n** 11.2. LTについて\n\n本記事ではスコープ外としましたが、LTにはLTの戦い方があります。\nLTは5分という短い時間で聴衆の心を掴む必要があり、技術的な深さよりも、面白さやインパクト、共感を呼ぶストーリー性が重視される傾向があります。\nお祭りのような側面も強く個人的にはあまり得意ではありませんが、短い時間で自分の考えを凝縮して伝えるよい訓練になることは間違いないでしょう。\n\n** 11.3. 経験の浅い人にこそプロポーザルを出してもらいたい\n\n経験の浅い方やこれからコミュニティで活動していきたいと考えている方にこそ、積極的にプロポーザルを出してもらいたいと私は考えています。\n\nプロポーザルを書くという行為は「自分が今、何に取り組んでいるのか」「次にどういうことをやりたいのか」といったことを言語化する絶好の機会になります。\n採択されるかどうかはあくまで結果論であり、その過程で得られる経験は無駄にはなりません。\n\n質の悪いプロポーザルを出してもどうせ採択されないだけです。\nあれこれ気にせずまずは提出してみてフィードバックのループを回していくのがよいでしょう。\n\n* 12. おわりに\n\natusyさんの [[https://blog.atusy.net/2025/05/30/how-to-win/][宝くじに当たる方法を思い出して、明日も頑張ることにした]] という記事が好きです。\n宝くじは買わなければ当たらないように、プロポーザルも出さなければ採択されることはありません。\n\n「打席に立って、きちんとヒットを打つ」ということを再現性高く繰り返すのが、かっこいい生き方だと私は思います。\nチャンスは逃さないようにしていきたいものです。\n\nまた、ベテランの中には無責任にアドバイスはするものの、自らは行動しない人が多いように感じます。\n「他人にアドバイスをするからには、まず自分が行動で示すべきだ」というのが私の価値観なので、これからもプロポーザルを出し打席に立ち続けたいという思いを込めてこの記事を書きました。\n\n偉そうなことを書きましたが自分自身も徹底できていない点が多いので引き続き精進します。\n",
  "backlinks": []
}